app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."album_id" = ?  [["album_id", 1]]
---
	      <i class="fas fa-heart red-icon" aria-hidden="true"></i>
	      <%= album.favorites.count %>いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."album_id" = ?  [["album_id", 1]]
---
	    <i class="fas fa-heart" aria-hidden:="true"></i>
	    <%= album.favorites.count %>いいね