app/views/users/carts.html.erb

				<% @orders.each do |cart| %>
					<% cart_album = Album.find(cart.album_id) %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]