app/views/sales_histories/new.html.erb

				<% @cart_items.each do |cart_item| %>
					<% cart_album = Album.find(cart_item.album_id) %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

		<%= form_for @sales_history, url: user_sales_histories_path(user_id: @user.id), method: :post do |f| %>
			<% @user.shipping_addresses.each do |ship_a| %>
---
SELECT "shipping_addresses".* FROM "shipping_addresses" WHERE "shipping_addresses"."user_id" = ?  [["user_id", 5]]