app/views/albums/_disc_fields.html.erb

SELECT "artists".* FROM "artists"
---
		<div class="field-selectbox">
			<%= f.collection_select :artist_id, Artist.all, :id, :name %>