app/views/albums/edit.html.erb

SELECT "genres".* FROM "genres"
---
					<div class="field-selectbox">
						<%= f.collection_select :genre_id, Genre.all, :id, :name %>

SELECT "labels".* FROM "labels"
---
					<div class="disc-field">
						<%= f.collection_select :label_id, Label.all, :id, :name %>