app/views/albums/show.html.erb

					<p>レーベル名: <%= @album_label.name %></p>
					<p>ディスク数: @album.discs.count</p>
---
SELECT COUNT(*) FROM "discs" WHERE "discs"."album_id" = ?  [["album_id", 3]]

      <div style="margin:30px 0;">
        <h3>いいねしたユーザー：<%= @album.favorites.count %></h3>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."album_id" = ?  [["album_id", 2]]