app/controllers/admins_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 5]]
---
  def favorites
    @user = User.find(params[:id])
    @favorites = Favorite.where(user_id: @user.id)