app/controllers/albums_controller.rb

INSERT INTO "albums" ("label_id", "genre_id", "title", "album_image_id", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @album = Album.new(album_params)
    @album.save

SELECT "albums".* FROM "albums" WHERE (title LIKE '%顔面%')
---
  def index
    @albums = Album.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @album = Album.find(params[:id])
    @album_genre = Genre.find_by(id: @album.genre_id)
    @album_label = Label.find_by(id: @album.label_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "album_image_id" = ?, "stock" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["album_image_id", nil], ["stock", 8], ["updated_at", "2019-09-02 10:53:11.503138"], ["id", 1]]
---
  def update
    album = Album.find(params[:id])
    album.update(album_params)