app/controllers/albums_controller.rb

  def index
    @albums = Album.page(params[:page]).per(12).reverse_order
---
SELECT  "albums".* FROM "albums" ORDER BY "albums"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]

  def search
    @search = Album.search(params[:search])
---
SELECT "albums".* FROM "albums" WHERE (title LIKE '%サン%')

  def show
    @album = Album.find(params[:id])
    @album_genre = Genre.find(@album.genre_id)
    @album_label = Label.find(@album.label_id)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]