app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)
    if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "X JAPAN"], ["created_at", "2019-11-04 12:50:04.676563"], ["updated_at", "2019-11-04 12:50:04.676563"]]

  def edit
    @title = "アーティスト編集"
    @resource = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]