app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["album_id", 2], ["created_at", "2019-11-06 11:53:21.004618"], ["updated_at", "2019-11-06 11:53:21.004618"]]
---
  def create
    @favorite = current_user.favorites.new(album_id: @album.id)
    @favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."album_id" = ? LIMIT ?  [["user_id", 5], ["album_id", 4], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 13]]
---
  def destroy
    @favorite = current_user.favorites.find_by(album_id: @album.id)
    @favorite.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_album
    @album = Album.find(params[:album_id])