app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 2]]
---
  def destroy
   @genre = Genre.find(params[:id])
   @genre.destroy