app/controllers/labels_controller.rb

  def index
    @labels = Label.all
---
SELECT "labels".* FROM "labels"

  def create
    @label = Label.new(label_params)
    if @label.save
---
INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ワーナーミュージック・ジャパン"], ["created_at", "2019-11-04 13:38:31.712489"], ["updated_at", "2019-11-04 13:38:31.712489"]]