app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."album_id" = ? LIMIT ?  [["user_id", 4], ["album_id", 1], ["LIMIT", 1]]
---
	def destroy
		if @album.in_cart?(current_user)
			order = Order.find_by(user_id: current_user.id, album_id: @album.id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def ensure_correct_user
		@order = Order.find(params[:id])