app/controllers/orders_controller.rb

	def create
		@album = Album.find(params[:album_id])
		unless @album.in_cart?(current_user)
			order = Order.new(user_id: current_user.id, album_id: @album.id)
			order.subtotal = @album.price
			order.save!
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "album_id", "subtotal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["album_id", 1], ["subtotal", 550], ["created_at", "2019-11-05 00:31:02.343626"], ["updated_at", "2019-11-05 00:31:02.343626"]]

	def update
		@order = Order.find(params[:id])
		@album = Album.find(params[:album_id])
		@user = User.find(@order.user_id)
		if @user != current_user
			redirect_to user_path(current_user)
		else
			new_number = params[:order][:number]
			if new_number.to_i > @album.stock
				flash[:danger] = "在庫数を超える購入はできません。"
				redirect_to user_carts_path(@user)
			else
				new_subtotal = (@album.price.to_i) * (new_number.to_i)
				if @order.update!(number: new_number, subtotal: new_subtotal)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "orders" SET "number" = ?, "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["number", 5], ["subtotal", 2750], ["updated_at", "2019-11-05 00:36:49.734631"], ["id", 2]]

	def destroy
		@album = Album.find(params[:album_id])
		if @album.in_cart?(current_user)
			order = Order.find_by(user_id: current_user.id, album_id: @album.id)
			order.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."album_id" = ? LIMIT ?  [["user_id", 4], ["album_id", 1], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]