app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @review = current_user.reviews.find(params[:id])
    @album = Album.find(@review.album_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "album_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["album_id", 1], ["body", "おはよう"], ["created_at", "2019-09-08 08:53:51.017257"], ["updated_at", "2019-09-08 08:53:51.017257"]]
---
  def create
    @album = Album.find(params[:album_id])
    review = current_user.reviews.new(review_params)
    review.album_id = @album.id
    review.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "body" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["body", "レビュー1-edit"], ["updated_at", "2019-09-08 05:56:58.202699"], ["id", 1]]
---
  def update
    @album = Album.find(params[:album_id])
    @review = current_user.reviews.find(params[:id])
    @review.update(review_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."id" = ? LIMIT ?  [["user_id", 1], ["id", 9], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 9]]
---
  def destroy
    @album = Album.find(params[:album_id])
    @review = current_user.reviews.find(params[:id])
    @review.destroy