app/controllers/sales_histories_controller.rb

  def create
    @user  = User.find(params[:user_id])
    @sales_history = SalesHistory.new(sales_history_params)
    if @user != current_user
      redirect_to user_path(current_user)
    else
      @cart_items = @user.orders.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]