app/controllers/sales_histories_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "sales_histories".* FROM "sales_histories" WHERE "sales_histories"."user_id" = ? AND "sales_histories"."deleted" IS NULL ORDER BY "sales_histories"."id" DESC LIMIT ? OFFSET ?  [["user_id", 5], ["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    if params[:user_id]
      @user = User.find(params[:user_id])
      @histories = SalesHistory.where(user_id: params[:user_id], deleted: nil).page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 5]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sales_histories" ("user_id", "shipping_address_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["shipping_address_id", 1], ["total", 3250], ["created_at", "2019-11-05 00:54:01.226880"], ["updated_at", "2019-11-05 00:54:01.226880"]]
INSERT INTO "history_items" ("sales_history_id", "album_id", "album_title", "album_price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "albums" SET "stock" = ?, "status" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["stock", 0], ["status", 0], ["updated_at", "2019-11-05 00:54:01.493001"], ["id", 1]]
---
  def create
    @user  = User.find(params[:user_id])
    @sales_history = SalesHistory.new(sales_history_params)
    if @user != current_user
      redirect_to user_path(current_user)
    else
      @cart_items = @user.orders.all
      @total = 500
      @error_albums = []
      i = 0
      @cart_items.each do |cart_item|
        cart_album = Album.find(cart_item.album_id)
        if cart_item.number > cart_album.stock
          @error_albums << cart_album
        end
        @total += cart_item.subtotal
      end
      if @error_albums != []
        # @error_albumsの中身がある時
        render 'users/carts'
      else
        if @sales_history.save
          @cart_items.each do |cart_item|
            cart_album = Album.find(cart_item.album_id)
            history_item = HistoryItem.new(
              sales_history_id: @sales_history.id,
              album_id: cart_album.id,
              album_title: cart_album.title,
              album_price: cart_album.price,
              quantity: cart_item.number)
            history_item.save
            newstock = cart_album.stock - history_item.quantity
            if newstock > 0
              cart_album.update(stock: newstock)
            else
              cart_album.update(stock: newstock, status: 0)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def ensure_correct_user
    @user  = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 5]]
---
  def set_correct_cart
    @user  = User.find(params[:user_id])
    if @user != current_user
      redirect_to user_path(current_user)
    else
      @cart_items = @user.orders.all
      @total = 500
      @cart_items.each do |cart_item|