app/controllers/sales_histories_controller.rb

  def hidden
    history = SalesHistory.find(params[:id])
---
SELECT  "sales_histories".* FROM "sales_histories" WHERE "sales_histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]