app/controllers/shipping_addresses_controller.rb

INSERT INTO "shipping_addresses" ("user_id", "postcode", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["postcode", "この辺"], ["address", "明太子"], ["created_at", "2019-09-09 10:51:19.106575"], ["updated_at", "2019-09-09 10:51:19.106575"]]
---
	def create
		shipping_address = current_user.shipping_addresses.new(shipping_address_params)
		shipping_address.save

SELECT  "shipping_addresses".* FROM "shipping_addresses" WHERE "shipping_addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@shipping_address = ShippingAddress.find(params[:id])

SELECT  "shipping_addresses".* FROM "shipping_addresses" WHERE "shipping_addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def update
		shipping_address = ShippingAddress.find(params[:id])