app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def carts
<<<<<<< HEAD
    @user = User.find(params[:id])
    @orders = @user.orders.all
    @sale = SalesHistory.new
=======
    @cart_items = @user.orders.all

UPDATE "users" SET "kana_first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["kana_first_name", "コメコメクラブ"], ["updated_at", "2019-08-27 08:18:14.506822"], ["id", 1]]
---
  def update
    @user.update(user_params)

UPDATE "users" SET "deleted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["deleted", "true"], ["updated_at", "2019-09-28 04:33:28.464818"], ["id", 1]]
---
  def destroy
    @user.update(deleted: "true")

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 5]]
---
  def favorites
    @favorites = Favorite.where(user_id: @user.id)