app/views/reviews/_review.html.erb

<tr class="review-tr">
	<% reviewer = User.find(review.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]