app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."deleted" = ? LIMIT ?  [["email", "us@football.com"], ["deleted", "true"], ["LIMIT", 1]]
---
   def reject_deleted_user
    @user = User.find_by(email: params[:user][:email], deleted: nil)